/*
 * 1. 단일 조건문	
 * 	  형식)
 *        if(조건문){
 *            조건문이 true 명 수행하는 문장 선언 부정연산자(!), 비교연산자(==, <=...)
 *            논리연산자,만 사용이가
 *        }
 * 2. 선택 조건문
 *       if(조건문){
 *          true 일때 수행
 *       }else{
 *       	false 일때 수행
 *       } else 문은 바로 위에잇는 if문 소속이다.
 *       if()
 *       ~
 *       ---------
 *       if()
 *       ~
 *       else()
 *       ---------
 *       => else 문은 단독으로 사용할 수 없다.
 *       
 * 3. 다중 조건문
 *      if(조건) ~~ else if(조건) ~~~ else if(조건)~~~else 
 *      	                                       ---- > 해당 조건이 없는 경우 처리하는 소스적용
 *      조건에 맞는 실행문을 처리한다.
 * --------------------------------------------------------------------------
 * 4. 선택문
 * 5. 반복문(for_1차)
 */
public class 제어문_정리 {

	public static void main(String[] args) {
		// TODO Auto-generated method stub

	}

}
